use master
go
create database TestDatabase
go

use TestDatabase
go

create table FACULTY
(
FACULTY nvarchar(10) primary key,
FACULTY_NAME nvarchar(100) unique
)
go

create table PULPIT
(
PULPIT nvarchar(10) primary key,
FACULTY nvarchar(10) references FACULTY(FACULTY) on delete cascade,
PULPIT_NAME nvarchar(100) unique
)
go

create table STUDENT
(
ID int primary key identity,
FACULTY nvarchar(10) references FACULTY(FACULTY) on delete cascade,
FULLNAME nvarchar(100) not null,
BDAY date not null,
)
go

insert FACULTY values	('ИТ','Информацинных технологий'),
						('ХТиТ','Химической технологии и техники'),
						('ТОВ','Технологий органический веществ'),
						('ЛХ','Лесного хозяйства')
go
insert PULPIT values	('ИСиТ','ИТ','Информационных систем и технологий'),
						('ПОиТ','ИТ','Программное обеспечение информационных технологий'),
						('ПиАХП','ХТиТ','Процессов и аппаратов химических производств'),
						('ТНВиОХТ','ХТиТ','Технологии неорганических веществ и общей химической технологии'),
						('ОХ','ТОВ','Органической химии'),
						('ХПД','ТОВ','Химической переработки древесины'),
						('ЛПиСПС','ЛХ','Ландшафтного проектирования и садово-паркового строи-тельства'),
						('ЛВ','ЛХ','Лесоводства')
go
insert STUDENT values	('ИТ','Пыркин Станислав','2000-08-03'),
						('ИТ','Чернявский Алексей','1999-04-02'),
						('ИТ','Миценской Степан','1999-12-24'),
						('ХТиТ','Белый Дмитрий','2000-04-16'),
						('ХТиТ','Хмурая Валерия','2000-07-14'),
						('ХТиТ','Жукова Александра','1999-05-14'),
						('ТОВ','Смелов Павел','1999-02-02'),
						('ТОВ','Жугин Степан','1998-03-12'),
						('ТОВ','Долгорукова Екатерина','2000-06-18'),
						('ЛХ','Пыркин Юрий','1987-06-09'),
						('ЛХ','Пыркин Михаил','1990-10-17'),
						('ЛХ','Путников Александр','1993-01-31')
go